export const teacherData: Record<string, { name: string; subject: string }> = {
  "math-3": {
    name: "أستاذ مشعل قناص الرويلي",
    subject: "معلم الرياضيات"
  },
  "reading-3": {
    name: "أستاذ ماجد بطيح العنزي",
    subject: "معلم لغتي"
  },
  "reading-6": {
    name: "أ.محمد عايد العنزي",
    subject: "معلم لغتي"
  },
  "math-6": {
    name: "أ. وليد عايد الرويلي",
    subject: "معلم الرياضيات"
  },
  "science-6": {
    name: "أ. مرضي خليل العنزي",
    subject: "معلم العلوم"
  }
};

export const grade3Students = [
  "باسل عبدالعزيز محمد المصلوخي",
  "تركي مبارك صخيل السويلمي",
  "تميم عيسى محيلان العنزي",
  "تميم مشعل محمد العنزي",
  "خالد مفلح هليل العنزي",
  "راكان فيصل خلف مناتي العنزي",
  "سلطان خلف موفق الرويلي",
  "عبدالله عبدالكريم حسين العنزي",
  "غيث جمعان بن عايش العنزي",
  "محمد بدر مرضي العنزي",
  "محمد نايف سعود العنزي",
  "محمد وليد علي علي",
  "مهند نادر عايد العنزي"
];

export const grade6Students = [
  "ابراهيم عارف سمير العنزي",
  "تركي احمد دلي العنزي",
  "حسام سيار خزيم العنزي",
  "ريان ماجد فعيران العنزي",
  "سلطان شولاح بادي الشمري",
  "عبدالله لؤي بخيت عبدالقادر",
  "فراس عبدالكريم حسين العنزي",
  "فهد فاضل راضي الرويلي",
  "مخلد بن ضيف الله بن سعود العتيبي",
  "مدين عارف حجي العنزي",
  "وليد عبدالله مطلق العنزي"
];

export const studentsData: Record<string, string[]> = {
  "math-3": grade3Students,
  "reading-3": grade3Students,
  "reading-6": grade6Students,
  "math-6": grade6Students,
  "science-6": grade6Students
};
